kAMDSuccess = "Não houve nenhum erro.";
kAMDUndefinedError = "Ocorreu um erro desconhecido.";
kAMDBadHeaderError = "Não foi possível transferir o arquivo.";
kAMDNoResourcesError = "Não foi possível alocar um recurso.";
kAMDReadError = "Não foi possível ler do dispositivo.";
kAMDWriteError = "Não foi possível gravar no dispositivo.";
kAMDUnknownPacketError = "O pacote não é conhecido.";
kAMDInvalidArgumentError = "O argumento não é válido.";
kAMDNotFoundError = "O arquivo não foi encontrado.";
kAMDIsDirectoryError = "O caminho é um diretório.";
kAMDPermissionError = "Você não tem permissão.";
kAMDNotConnectedError = "Não conectado ao dispositivo.";
kAMDTimeOutError = "Foi alcançado o limite de tempo da operação.";
kAMDOverrunError = "Houve falta de dados no buffer.";
kAMDEOFError = "Fim do arquivo.";
kAMDUnsupportedError = "Esta operação é incompatível.";
kAMDFileExistsError = "O arquivo já existe.";
kAMDBusyError = "O dispositivo está ocupado.";
kAMDCryptoError = "Não foi possível estabelecer uma conexão segura com o dispositivo.";
kAMDTooBigError = "A mensagem é muito longa.";
kAMDInvalidResponseError = "Foi recebida uma resposta inesperada do dispositivo.";
kAMDMissingKeyError = "A chave está faltando.";
kAMDMissingValueError = "O valor está faltando.";
kAMDGetProhibitedError = "Não é possível recuperar o valor do dispositivo protegido por código.";
kAMDSetProhibitedError = "Não é possível definir o valor no dispositivo.";
kAMDRemoveProhibitedError = "Não é remover o valor no dispositivo.";
kAMDImmutableValueError = "Este valor não pode ser alterado.";
kAMDPasswordProtectedError = "O documento está protegido por código.";
kAMDMissingHostIDError = "O dispositivo não reconhece este host.";
kAMDInvalidHostIDError = "O dispositivo não reconhece este host.";
kAMDSessionActiveError = "A sessão está ativa.";
kAMDSessionInactiveError = "A sessão está inativa.";
kAMDMissingSessionIDError = "O ID da sessão está faltando.";
kAMDInvalidSessionIDError = "O ID da sessão não é válido.";
kAMDMissingServiceError = "O serviço está faltando.";
kAMDInvalidServiceError = "O serviço não é válido.";
kAMDServiceLimitError = "Já há muitas instâncias deste serviço sendo executadas.";
kAMDCheckinSetupFailedError = "Não foi possível iniciar o serviço no dispositivo";
kAMDInvalidCheckinError = "Não foi possível iniciar o serviço no dispositivo";
kAMDCheckinTimeoutError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDCheckinConnectionFailedError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDCheckinReceiveFailedError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDCheckinResponseFailedError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDCheckinOutOfMemoryError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDCheckinSendFailedError = "O serviço não foi iniciado corretamente no dispositivo.";
kAMDMissingPairRecordError = "O host não está emparelhado com o dispositivo.";
kAMDInvalidPairRecordError = "O host não está mais emparelhado com o dispositivo.";
kAMDSavePairRecordFailedError = "Não foi possível salvar o registro do emparelhamento.";
kAMDInvalidActivationRecordError = "O registro de ativação não é válido.";
kAMDMissingActivationRecordError = "O registro de ativação não foi encontrado.";
kAMDServiceProhibitedError = "O serviço não pôde ser iniciado no dispositivo.";
kAMDEscrowLockedError = "O dispositivo só fica disponível no primeiro desbloqueio, após reinicializar.";
kAMDProhibitedBySupervision = "Operação não permitida em dispositivos supervisionados.";
kAMDPairingProhibitedError = "O emparelhamento só é permitido via USB.";
kAMDWrongDroidError = "O dispositivo está em modo de recuperação.";
kAMDSUVerificationError = "O pacote da atualização de software não pôde ser verificado.";
kAMDSUPatchError = "Não foi possível emendar o arquivo.";
kAMDSUFirmwareError = "Não foi possível atualizar o firmware.";
kAMDProvisioningProfileNotValid = "O perfil de provisão não é válido.";
kAMDSendMessageError = "Não foi possível enviar uma mensagem ao dispositivo.";
kAMDReceiveMessageError = "Não foi possível receber uma mensagem do dispositivo.";
kAMDMissingOptionsError = "As opções estão faltando.";
kAMDMissingImageTypeError = "A imagem está faltando.";
kAMDDigestFailedError = "Não foi possível ler a imagem de disco.";
kAMDStartServiceError = "O serviço não pôde ser iniciado.";
kAMDInvalidDiskImageError = "A imagem de disco não é válida.";
kAMDMissingDigestError = "A compilação está faltando.";
kAMDMuxError = "Houve um erro com o dispositivo multiplexador USB.";
kAMDApplicationAlreadyInstalledError = "Um aplicativo do sistema com o identificador de pacote especificado já está instalado no dispositivo e não pode ser substituído.";
kAMDApplicationMoveFailedError = "O aplicativo não pôde ser movido no dispositivo.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "O aplicativo não pôde ser isolado.";
kAMDApplicationVerificationFailedError = "O aplicativo não pôde ser verificado.";
kAMDArchiveDestructionFailedError = "Não foi possível remover o arquivo do aplicativo.";
kAMDBundleVerificationFailedError = "O pacote da operadora não pôde ser verificado.";
kAMDCarrierBundleCopyFailedError = "Não foi possível instalar o pacote da operadora.";
kAMDCarrierBundleDirectoryCreationFailedError = "Não foi possível criar o diretório do pacote da operadora.";
kAMDCarrierBundleMissingSupportedSIMsError = "Não há SIMs compatíveis com este pacote da operadora.";
kAMDCommCenterNotificationFailedError = "Não foi possível detectar notificações da banda base.";
kAMDContainerCreationFailedError = "Não foi possível criar o contêiner do aplicativo.";
kAMDContainerP0wnFailedError = "Não foi possível reparar as permissões no contêiner do aplicativo.";
kAMDContainerRemovalFailedError = "Não foi possível remover o contêiner do aplicativo.";
kAMDEmbeddedProfileInstallFailedError = "Não foi possível instalar o arquivo de provisão integrado.";
kAMDErrorError = "Ocorreu um erro.";
kAMDExecutableTwiddleFailedError = "Não foi possível alterar as permissões executáveis no aplicativo.";
kAMDExistenceCheckFailedError = "Não foi possível verificar se o aplicativo já existe.";
kAMDInstallMapUpdateFailedError = "Não foi possível atualizar a lista de aplicativos instalados.";
kAMDManifestCaptureFailedError = "Não foi possível salvar o manifesto do aplicativo.";
kAMDMapGenerationFailedError = "Não foi possível gerar o mapa.";
kAMDMissingBundleExecutableError = "O pacote do aplicativo não contém um executável.";
kAMDMissingBundleIdentifierError = "O pacote do aplicativo não contém um identificador válido.";
kAMDMissingBundlePathError = "Não foi possível determinar o caminho do pacote do aplicativo.";
kAMDMissingContainerError = "Não foi possível encontrar o contêiner do aplicativo instalado.";
kAMDNotificationFailedError = "Não foi possível postar uma notificação.";
kAMDPackageExtractionFailedError = "Não foi possível abrir o pacote do aplicativo.";
kAMDPackageInspectionFailedError = "Não foi possível inspecionar o pacote do aplicativo.";
kAMDPackageMoveFailedError = "Não foi possível mover o pacote do aplicativo para a localização de teste.";
kAMDPathConversionFailedError = "Não foi possível converter o caminho.";
kAMDRestoreContainerFailedError = "Não foi possível restaurar o contêiner do aplicativo.";
kAMDSeatbeltProfileRemovalFailedError = "Não foi possível remover o perfil de segurança do aplicativo.";
kAMDStageCreationFailedError = "Não foi possível criar o diretório de teste.";
kAMDSymlinkFailedError = "Não foi possível criar o link simbólico.";
kAMDiTunesArtworkCaptureFailedError = "Não foi possível salvar a capa do iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Não foi possível salvar os metadados do iTunes.";
kAMDAlreadyArchivedError = "O aplicativo já está arquivado.";
kAMDUnknownCommandError = "O dispositivo não reconhece o comando.";
kAMDAPIInternalError = "Houve um erro interno da API.";
kAMDMuxCreateListenerError = "Não foi possível detectar dispositivos USB.";
kAMDMuxGetListenerError = "Não foi possível obter o detector de USB.";
kAMDMuxConnectError = "Não foi possível conectar ao dispositivo.";
kAMDDeviceTooNewError = "Este aplicativo precisa ser atualizado.";
kAMDDeviceRefNoGood = "Este dispositivo não está mais conectado.";
kAMDDeviceDisconnectedError = "Este dispositivo não está mais conectado.";
kAMDCannotTranslateError = "Não foi possível traduzir as mensagens do dispositivo.";
kAMDMobileImageMounterMissingImageSignature = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterResponseCreationFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterMissingImageType = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterMissingImagePath = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageMapLoadFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterAlreadyMounted = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageMoveFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterMountPathMissing = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterMountPathNotEmpty = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageMountFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterDigestFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterDigestCreationFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageVerificationFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageInfoCreationFailed = "Impossível suportar objeto desenvolvido.";
kAMDMobileImageMounterImageMapStoreFailed = "Impossível suportar objeto desenvolvido.";
kAMDDeviceOSVersionTooLow = "A versão do Sist. Operacional é muito antiga.";
kAMDNoWifiSyncSupportError = "O dispositivo não é compatível com a sincroniz. sem fio.";
kAMDDeviceFamilyNotSupported = "Este aplicativo não é compatível com este tipo de dispositivo.";
kAMDPackagePatchFailedError = "Não pôde aplicar a atualização corretiva ao aplicativo.";
kAMDIncorrectArchitectureError = "Este aplicativo não é compatível com o tipo de CPU deste dispositivo.";
kAMDPluginCopyFailedError = "Não pôde copiar o Plug-in VPN no contêiner do aplicativo.";
kAMDBreadcrumbFailedError = "Não pôde gravar a navegação estrutural da instalação.";
kAMDBreadcrumbUnlockError = "Não pôde atualizar a navegação estrutural da instalação.";
kAMDGeoJSONCaptureFailedError = "Não pôde salvar os dados GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Não pôde salvar as capas do aplicativo Banca.";
kAMDMissingCommandError = "O pedido não continha um comando.";
kAMDNotEntitledError = "O aplicativo solicitante não tem permissão para fazer este pedido.";
kAMDMissingPackagePathError = "Estava faltando o caminho do pacote no pedido.";
kAMDMissingContainerPathError = "Estava faltando o caminho do contêiner no pedido.";
kAMDMissingApplicationIdentifierError = "Estava faltando o identificador do aplicativo no pedido.";
kAMDMissingAttributeValueError = "Estava faltando um valor necessário no pedido.";
kAMDLookupFailedError = "Não pôde listar os aplicativos instalados.";
kAMDDictCreationFailedError = "Não pôde extrair as capacidades do pedido.";

/* kMISFileError */
"A file operation failed." = "Uma operação de arquivo falhou.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Um recurso assinado foi adicionado, modificado ou apagado.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Não foi encontrado um perfil de provisão válido para este executável.";

/* kMISUnknownError */
"An unknown error has occurred." = "Ocorreu um erro desconhecido.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Tentativa de modificação de um perfil de provisão imutável.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "O aplicativo não tem uma assinatura válida.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "A assinatura do aplicativo é válida, mas não coincide com o número esperado.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "O executável contém uma assinatura inválida.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "O executável foi assinado com direitos inválidos.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "A identidade usada para assinar o executável não é mais válida.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "A assinatura não era válida.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Ocorreu um erro de comunicação com seu dispositivo.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Este perfil de provisão não pode ser instalado neste dispositivo.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Este perfil de provisão não tem uma assinatura válida (ou tem uma assinatura válida, mas não confiável).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Este perfil de provisão expirou.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Este perfil de provisão é malformado.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Este perfil de provisão é incompatível.";

/* kMISAllocationError */
"Unable to allocate memory." = "Não foi possível alocar memória.";

